<?php defined('SYSPATH') OR die('No direct access allowed.');

$lang = array
(
	'title' => 'Главная страница',
	'feedback' => 'Обратная связь',
	
	'firm_desc' => 'Квартидар.RU',
	'sale' => 'Продаю',
	'sale_title' => 'Продаю жилую или коммерческую недвижимость',
	'purchase' => 'Куплю',
	'purchase_title' => 'Куплю жилую или коммерческую недвижимость',
	'letting' => 'Сдаю',
	'letting_title' => 'Сдаю жилую или коммерческую недвижимость',
	'rent' => 'Сниму',
	'rent_title' => 'Сниму жилую или коммерческую недвижимость',
	'main' => 'Приветствие',
	'main_title' => 'Главная',
	'site_desc' => 'Недвижимость Краснодара',
	'site_title_alt' => 'Объявления недвижимости без посредников',
	'main_stat' => array('Сейчас на сайте %d объявлений', 'Сейчас на сайте %d объявление', 'Сейчас на сайте %d объявления'),
	

	'search_step' => 'Заполните форму поиска',
	'search_step_desc' => 'Необходимо выбрать рубрику объявлений и заполнить критерии поиска, по которым будет производиться поиск недвижимости.',
	'search_step_alt' => 'Заполните форму поиска',
	'result_step' => 'Выберите обьявление',
	'result_step_desc' => 'Затем выбрать подходящее обьявление из предложенного списка.',
	'result_step_alt' => 'Выберите объявление',
	'sms_step' => 'Отправте SMS',
	'sms_step_desc' => 'Для получения контактных данных владельца выбранного объявления, необходимо отправить SMS.',
	'sms_step_alt' => 'Отправте SMS',
	'owner_step' => 'Получите контакты',
	'owner_step_desc' => 'В ответном SMS прейдет номер телефона владельца объявления.',
	'owner_step_alt' => 'Получите контакты',
	
	'welcome' => 'Добро пожаловать на наш сайт',
	'welcome_title' => 'Мы за актуальность и чистоту',
	'welcome_desc' => 'Перед каждой публикацией обьявления на сайт, мы связываемся с владелцем объекта недвижимости, уточняем данные по обьекта.<p>Через определённый период времени, мы проверяем актуальность всех обьявлений, с помощью прозвона.</p>',
	
	'news' => 'Обьявления Краснодара',
	'news_desc' => 'Мы собираем объявления из раздичных источников: печатные издания г. Краснодара, сайты посвещянные недвижимости, обьявления на стенах города.',
        
        'main_title' => 'Недвижимость Краснодара',
        'main_error' => 'Ошибка на сайте',

			'how_work' => 'Как работает сайт',
			'feedback_title' => 'Связаться с нами',
			'alt_logo' => 'Связаться с нами',
			'go_to_nonmobile' => 'Перейти на не мобильную версию сайта',
			'select_type' => 'Выберите тип сделки:',


	'site_logo_alt' => 'Добро пожаловать!',

    /////


      'keywords'=>"недвижимость в Краснодаре, недвижимость Краснодара,недвижимость Краснодарского края,коммерческая недвижимость, недвижимость, аренда, без посредников, квартира, дом",

        "description"=>"Жилая и коммерческая недвижимость Краснодара без посредников. Продажа и сдача в аренду. Квартиры, коммерческая и производственная недвижимость, продажа домов, дач или дачных участков. База недвижимости в Краснодаре"


);